MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFH100/mcu.h
extern volatile __REFO2CONbits_t REFO2CONbits __asm__ ("REFO2CON") __attribute__((section("sfrs"), address(0xBF8012A0)));
extern volatile uint32_t        REFO2CONCLR __attribute__((section("sfrs"),address(0xBF8012A4)));
extern volatile uint32_t        REFO2CONSET __attribute__((section("sfrs"),address(0xBF8012A8)));
extern volatile uint32_t        REFO2CONINV __attribute__((section("sfrs"),address(0xBF8012AC)));
#define REFO2TRIM REFO2TRIM
extern volatile uint32_t   REFO2TRIM __attribute__((section("sfrs"), address(0xBF8012B0)));
typedef struct {
  uint32_t :23;
  uint32_t ROTRIM:9;
} __REFO2TRIMbits_t;
extern volatile __REFO2TRIMbits_t REFO2TRIMbits __asm__ ("REFO2TRIM") __attribute__((section("sfrs"), address(0xBF8012B0)));
extern volatile uint32_t        REFO2TRIMCLR __attribute__((section("sfrs"),address(0xBF8012B4)));
extern volatile uint32_t        REFO2TRIMSET __attribute__((section("sfrs"),address(0xBF8012B8)));
extern volatile uint32_t        REFO2TRIMINV __attribute__((section("sfrs"),address(0xBF8012BC)));
#define REFO3CON REFO3CON
extern volatile uint32_t   REFO3CON __attribute__((section("sfrs"), address(0xBF8012C0)));
typedef struct {
  uint32_t ROSEL:4;
  uint32_t :4;
  uint32_t ACTIVE:1;
  uint32_t DIVSWEN:1;
  uint32_t :1;
  uint32_t RSLP:1;
  uint32_t OE:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t RODIV:15;
} __REFO3CONbits_t;
extern volatile __REFO3CONbits_t REFO3CONbits __asm__ ("REFO3CON") __attribute__((section("sfrs"), address(0xBF8012C0)));
extern volatile uint32_t        REFO3CONCLR __attribute__((section("sfrs"),address(0xBF8012C4)));
extern volatile uint32_t        REFO3CONSET __attribute__((section("sfrs"),address(0xBF8012C8)));
extern volatile uint32_t        REFO3CONINV __attribute__((section("sfrs"),address(0xBF8012CC)));
#define REFO3TRIM REFO3TRIM
extern volatile uint32_t   REFO3TRIM __attribute__((section("sfrs"), address(0xBF8012D0)));
typedef struct {
  uint32_t :23;
  uint32_t ROTRIM:9;
} __REFO3TRIMbits_t;
extern volatile __REFO3TRIMbits_t REFO3TRIMbits __asm__ ("REFO3TRIM") __attribute__((section("sfrs"), address(0xBF8012D0)));
extern volatile uint32_t        REFO3TRIMCLR __attribute__((section("sfrs"),address(0xBF8012D4)));
extern volatile uint32_t        REFO3TRIMSET __attribute__((section("sfrs"),address(0xBF8012D8)));
extern volatile uint32_t        REFO3TRIMINV __attribute__((section("sfrs"),address(0xBF8012DC)));
#define REFO4CON REFO4CON
extern volatile uint32_t   REFO4CON __attribute__((section("sfrs"), address(0xBF8012E0)));
typedef struct {
  uint32_t ROSEL:4;
  uint32_t :4;
  uint32_t ACTIVE:1;
  uint32_t DIVSWEN:1;
  uint32_t :1;
  uint32_t RSLP:1;
  uint32_t OE:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t RODIV:15;
} __REFO4CONbits_t;
extern volatile __REFO4CONbits_t REFO4CONbits __asm__ ("REFO4CON") __attribute__((section("sfrs"), address(0xBF8012E0)));
extern volatile uint32_t        REFO4CONCLR __attribute__((section("sfrs"),address(0xBF8012E4)));
extern volatile uint32_t        REFO4CONSET __attribute__((section("sfrs"),address(0xBF8012E8)));
extern volatile uint32_t        REFO4CONINV __attribute__((section("sfrs"),address(0xBF8012EC)));
#define REFO4TRIM REFO4TRIM
extern volatile uint32_t   REFO4TRIM __attribute__((section("sfrs"), address(0xBF8012F0)));
typedef struct {
  uint32_t :23;
  uint32_t ROTRIM:9;
} __REFO4TRIMbits_t;
extern volatile __REFO4TRIMbits_t REFO4TRIMbits __asm__ ("REFO4TRIM") __attribute__((section("sfrs"), address(0xBF8012F0)));
extern volatile uint32_t        REFO4TRIMCLR __attribute__((section("sfrs"),address(0xBF8012F4)));
extern volatile uint32_t        REFO4TRIMSET __attribute__((section("sfrs"),address(0xBF8012F8)));
extern volatile uint32_t        REFO4TRIMINV __attribute__((section("sfrs"),address(0xBF8012FC)));
#define PB1DIV PB1DIV
extern volatile uint32_t   PB1DIV __attribute__((section("sfrs"), address(0xBF801300)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
} __PB1DIVbits_t;
extern volatile __PB1DIVbits_t PB1DIVbits __asm__ ("PB1DIV") __attribute__((section("sfrs"), address(0xBF801300)));
extern volatile uint32_t        PB1DIVCLR __attribute__((section("sfrs"),address(0xBF801304)));
extern volatile uint32_t        PB1DIVSET __attribute__((section("sfrs"),address(0xBF801308)));
extern volatile uint32_t        PB1DIVINV __attribute__((section("sfrs"),address(0xBF80130C)));
#define PB2DIV PB2DIV
extern volatile uint32_t   PB2DIV __attribute__((section("sfrs"), address(0xBF801310)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t ON:1;
} __PB2DIVbits_t;
extern volatile __PB2DIVbits_t PB2DIVbits __asm__ ("PB2DIV") __attribute__((section("sfrs"), address(0xBF801310)));
extern volatile uint32_t        PB2DIVCLR __attribute__((section("sfrs"),address(0xBF801314)));
extern volatile uint32_t        PB2DIVSET __attribute__((section("sfrs"),address(0xBF801318)));
extern volatile uint32_t        PB2DIVINV __attribute__((section("sfrs"),address(0xBF80131C)));
#define PB3DIV PB3DIV
extern volatile uint32_t   PB3DIV __attribute__((section("sfrs"), address(0xBF801320)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t ON:1;
} __PB3DIVbits_t;
extern volatile __PB3DIVbits_t PB3DIVbits __asm__ ("PB3DIV") __attribute__((section("sfrs"), address(0xBF801320)));
extern volatile uint32_t        PB3DIVCLR __attribute__((section("sfrs"),address(0xBF801324)));
extern volatile uint32_t        PB3DIVSET __attribute__((section("sfrs"),address(0xBF801328)));
extern volatile uint32_t        PB3DIVINV __attribute__((section("sfrs"),address(0xBF80132C)));
#define PB4DIV PB4DIV
extern volatile uint32_t   PB4DIV __attribute__((section("sfrs"), address(0xBF801330)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t ON:1;
} __PB4DIVbits_t;
extern volatile __PB4DIVbits_t PB4DIVbits __asm__ ("PB4DIV") __attribute__((section("sfrs"), address(0xBF801330)));
extern volatile uint32_t        PB4DIVCLR __attribute__((section("sfrs"),address(0xBF801334)));
extern volatile uint32_t        PB4DIVSET __attribute__((section("sfrs"),address(0xBF801338)));
extern volatile uint32_t        PB4DIVINV __attribute__((section("sfrs"),address(0xBF80133C)));
#define PB5DIV PB5DIV
extern volatile uint32_t   PB5DIV __attribute__((section("sfrs"), address(0xBF801340)));
typedef struct {
  uint32_t PBDIV:7;
  uint32_t :4;
  uint32_t PBDIVRDY:1;
  uint32_t :3;
  uint32_t ON:1;
} __PB5DIVbits_t;
