MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFH100/mcu.h
extern volatile __EBISMT2bits_t EBISMT2bits __asm__ ("EBISMT2") __attribute__((section("sfrs"), address(0xBF8E109C)));
#define EBIFTRPD EBIFTRPD
extern volatile uint32_t   EBIFTRPD __attribute__((section("sfrs"), address(0xBF8E10A0)));
typedef struct {
  uint32_t TRPD:32;
} __EBIFTRPDbits_t;
extern volatile __EBIFTRPDbits_t EBIFTRPDbits __asm__ ("EBIFTRPD") __attribute__((section("sfrs"), address(0xBF8E10A0)));
#define EBISMCON EBISMCON
extern volatile uint32_t   EBISMCON __attribute__((section("sfrs"), address(0xBF8E10A4)));
typedef struct {
  uint32_t SMRP:1;
  uint32_t :6;
  uint32_t SMDWIDTH0:3;
  uint32_t SMDWIDTH1:3;
  uint32_t SMDWIDTH2:3;
} __EBISMCONbits_t;
extern volatile __EBISMCONbits_t EBISMCONbits __asm__ ("EBISMCON") __attribute__((section("sfrs"), address(0xBF8E10A4)));
#define SQI1XCON1 SQI1XCON1
extern volatile uint32_t   SQI1XCON1 __attribute__((section("sfrs"), address(0xBF8E2000)));
typedef struct {
  uint32_t TYPECMD:2;
  uint32_t TYPEADDR:2;
  uint32_t TYPEMODE:2;
  uint32_t TYPEDUMMY:2;
  uint32_t TYPEDATA:2;
  uint32_t READOPCODE:8;
  uint32_t ADDRBYTES:3;
  uint32_t DUMMYBYTES:3;
  uint32_t DDRCMD:1;
  uint32_t DDRADDR:1;
  uint32_t DDRMODE:1;
  uint32_t DDRDUMMY:1;
  uint32_t DDRDATA:1;
  uint32_t SDRCMD:1;
} __SQI1XCON1bits_t;
extern volatile __SQI1XCON1bits_t SQI1XCON1bits __asm__ ("SQI1XCON1") __attribute__((section("sfrs"), address(0xBF8E2000)));
#define SQI1XCON2 SQI1XCON2
extern volatile uint32_t   SQI1XCON2 __attribute__((section("sfrs"), address(0xBF8E2004)));
typedef struct {
  uint32_t MODECODE:8;
  uint32_t MODEBYTES:2;
  uint32_t DEVSEL:2;
} __SQI1XCON2bits_t;
extern volatile __SQI1XCON2bits_t SQI1XCON2bits __asm__ ("SQI1XCON2") __attribute__((section("sfrs"), address(0xBF8E2004)));
#define SQI1CFG SQI1CFG
extern volatile uint32_t   SQI1CFG __attribute__((section("sfrs"), address(0xBF8E2008)));
typedef struct {
  uint32_t MODE:3;
  uint32_t CPHA:1;
  uint32_t CPOL:1;
  uint32_t LSBF:1;
  uint32_t :3;
  uint32_t WP:1;
  uint32_t HOLD:1;
  uint32_t :1;
  uint32_t BURSTEN:1;
  uint32_t :3;
  uint32_t RESET:1;
  uint32_t TXBUFRST:1;
  uint32_t RXBUFRST:1;
  uint32_t CONBUFRST:1;
  uint32_t DATAEN:2;
  uint32_t :1;
  uint32_t SQIEN:1;
  uint32_t CSEN:2;
} __SQI1CFGbits_t;
extern volatile __SQI1CFGbits_t SQI1CFGbits __asm__ ("SQI1CFG") __attribute__((section("sfrs"), address(0xBF8E2008)));
#define SQI1CON SQI1CON
extern volatile uint32_t   SQI1CON __attribute__((section("sfrs"), address(0xBF8E200C)));
typedef struct {
  uint32_t TXRXCOUNT:16;
  uint32_t CMDINIT:2;
  uint32_t LANEMODE:2;
  uint32_t DEVSEL:2;
  uint32_t DASSERT:1;
  uint32_t DDRMODE:1;
  uint32_t SCHECK:1;
} __SQI1CONbits_t;
extern volatile __SQI1CONbits_t SQI1CONbits __asm__ ("SQI1CON") __attribute__((section("sfrs"), address(0xBF8E200C)));
#define SQI1CLKCON SQI1CLKCON
extern volatile uint32_t   SQI1CLKCON __attribute__((section("sfrs"), address(0xBF8E2010)));
typedef struct {
  uint32_t EN:1;
  uint32_t STABLE:1;
  uint32_t :6;
  uint32_t CLKDIV:11;
} __SQI1CLKCONbits_t;
extern volatile __SQI1CLKCONbits_t SQI1CLKCONbits __asm__ ("SQI1CLKCON") __attribute__((section("sfrs"), address(0xBF8E2010)));
#define SQI1CMDTHR SQI1CMDTHR
extern volatile uint32_t   SQI1CMDTHR __attribute__((section("sfrs"), address(0xBF8E2014)));
typedef struct {
  uint32_t RXCMDTHR:6;
  uint32_t :2;
  uint32_t TXCMDTHR:6;
} __SQI1CMDTHRbits_t;
extern volatile __SQI1CMDTHRbits_t SQI1CMDTHRbits __asm__ ("SQI1CMDTHR") __attribute__((section("sfrs"), address(0xBF8E2014)));
#define SQI1INTTHR SQI1INTTHR
extern volatile uint32_t   SQI1INTTHR __attribute__((section("sfrs"), address(0xBF8E2018)));
typedef struct {
  uint32_t RXINTTHR:6;
  uint32_t :2;
  uint32_t TXINTTHR:6;
} __SQI1INTTHRbits_t;
extern volatile __SQI1INTTHRbits_t SQI1INTTHRbits __asm__ ("SQI1INTTHR") __attribute__((section("sfrs"), address(0xBF8E2018)));
#define SQI1INTEN SQI1INTEN
extern volatile uint32_t   SQI1INTEN __attribute__((section("sfrs"), address(0xBF8E201C)));
typedef struct {
  uint32_t TXEMPTYIE:1;
  uint32_t TXFULLIE:1;
  uint32_t TXTHRIE:1;
  uint32_t RXEMPTYIE:1;
  uint32_t RXFULLIE:1;
  uint32_t RXTHRIE:1;
  uint32_t CONFULLIE:1;
  uint32_t CONEMPTYIE:1;
  uint32_t CONTHRIE:1;
  uint32_t BDDONEIE:1;
  uint32_t PKTCOMPIE:1;
  uint32_t DMAEIE:1;
} __SQI1INTENbits_t;
extern volatile __SQI1INTENbits_t SQI1INTENbits __asm__ ("SQI1INTEN") __attribute__((section("sfrs"), address(0xBF8E201C)));
#define SQI1INTSTAT SQI1INTSTAT
extern volatile uint32_t   SQI1INTSTAT __attribute__((section("sfrs"), address(0xBF8E2020)));
typedef struct {
  uint32_t TXEMPTYIF:1;
  uint32_t TXFULLIF:1;
  uint32_t TXTHRIF:1;
  uint32_t RXEMPTYIF:1;
  uint32_t RXFULLIF:1;
  uint32_t RXTHRIF:1;
  uint32_t CONFULLIF:1;
  uint32_t CONEMPTYIF:1;
  uint32_t CONTHRIF:1;
  uint32_t BDDONEIF:1;
  uint32_t PKTCOMPIF:1;
  uint32_t DMAEIF:1;
} __SQI1INTSTATbits_t;
extern volatile __SQI1INTSTATbits_t SQI1INTSTATbits __asm__ ("SQI1INTSTAT") __attribute__((section("sfrs"), address(0xBF8E2020)));
#define SQI1TXDATA SQI1TXDATA
extern volatile uint32_t   SQI1TXDATA __attribute__((section("sfrs"), address(0xBF8E2024)));
typedef struct {
  uint32_t TXDATA:32;
} __SQI1TXDATAbits_t;
extern volatile __SQI1TXDATAbits_t SQI1TXDATAbits __asm__ ("SQI1TXDATA") __attribute__((section("sfrs"), address(0xBF8E2024)));
#define SQI1RXDATA SQI1RXDATA
extern volatile uint32_t   SQI1RXDATA __attribute__((section("sfrs"), address(0xBF8E2028)));
typedef struct {
  uint32_t RXDATA:32;
} __SQI1RXDATAbits_t;
extern volatile __SQI1RXDATAbits_t SQI1RXDATAbits __asm__ ("SQI1RXDATA") __attribute__((section("sfrs"), address(0xBF8E2028)));
#define SQI1STAT1 SQI1STAT1
extern volatile uint32_t   SQI1STAT1 __attribute__((section("sfrs"), address(0xBF8E202C)));
typedef struct {
  uint32_t RXBUFCNT:6;
  uint32_t :10;
  uint32_t TXBUFFREE:6;
} __SQI1STAT1bits_t;
extern volatile __SQI1STAT1bits_t SQI1STAT1bits __asm__ ("SQI1STAT1") __attribute__((section("sfrs"), address(0xBF8E202C)));
#define SQI1STAT2 SQI1STAT2
extern volatile uint32_t   SQI1STAT2 __attribute__((section("sfrs"), address(0xBF8E2030)));
typedef struct {
  uint32_t TXOV:1;
  uint32_t RXUN:1;
  uint32_t :1;
  uint32_t SQID0:1;
  uint32_t SQID1:1;
  uint32_t SQID2:1;
  uint32_t SQID3:1;
  uint32_t CONAVAIL:4;
  uint32_t :5;
  uint32_t CMDSTAT:2;
} __SQI1STAT2bits_t;
extern volatile __SQI1STAT2bits_t SQI1STAT2bits __asm__ ("SQI1STAT2") __attribute__((section("sfrs"), address(0xBF8E2030)));
#define SQI1BDCON SQI1BDCON
extern volatile uint32_t   SQI1BDCON __attribute__((section("sfrs"), address(0xBF8E2034)));
typedef struct {
  uint32_t DMAEN:1;
  uint32_t POLLEN:1;
  uint32_t START:1;
} __SQI1BDCONbits_t;
extern volatile __SQI1BDCONbits_t SQI1BDCONbits __asm__ ("SQI1BDCON") __attribute__((section("sfrs"), address(0xBF8E2034)));
#define SQI1BDCURADD SQI1BDCURADD
extern volatile uint32_t   SQI1BDCURADD __attribute__((section("sfrs"), address(0xBF8E2038)));
typedef struct {
  uint32_t BDCURRADDR:32;
} __SQI1BDCURADDbits_t;
extern volatile __SQI1BDCURADDbits_t SQI1BDCURADDbits __asm__ ("SQI1BDCURADD") __attribute__((section("sfrs"), address(0xBF8E2038)));
#define SQI1BDBASEADD SQI1BDBASEADD
extern volatile uint32_t   SQI1BDBASEADD __attribute__((section("sfrs"), address(0xBF8E2040)));
typedef struct {
  uint32_t BDADDR:32;
} __SQI1BDBASEADDbits_t;
extern volatile __SQI1BDBASEADDbits_t SQI1BDBASEADDbits __asm__ ("SQI1BDBASEADD") __attribute__((section("sfrs"), address(0xBF8E2040)));
#define SQI1BDSTAT SQI1BDSTAT
extern volatile uint32_t   SQI1BDSTAT __attribute__((section("sfrs"), address(0xBF8E2044)));
typedef struct {
  uint32_t BDCON:16;
  uint32_t DMAACTV:1;
  uint32_t DMASTART:1;
  uint32_t BDSTATE:4;
} __SQI1BDSTATbits_t;
extern volatile __SQI1BDSTATbits_t SQI1BDSTATbits __asm__ ("SQI1BDSTAT") __attribute__((section("sfrs"), address(0xBF8E2044)));
#define SQI1BDPOLLCON SQI1BDPOLLCON
extern volatile uint32_t   SQI1BDPOLLCON __attribute__((section("sfrs"), address(0xBF8E2048)));
typedef struct {
  uint32_t POLLCON:16;
} __SQI1BDPOLLCONbits_t;
extern volatile __SQI1BDPOLLCONbits_t SQI1BDPOLLCONbits __asm__ ("SQI1BDPOLLCON") __attribute__((section("sfrs"), address(0xBF8E2048)));
#define SQI1BDTXDSTAT SQI1BDTXDSTAT
extern volatile uint32_t   SQI1BDTXDSTAT __attribute__((section("sfrs"), address(0xBF8E204C)));
typedef struct {
  uint32_t TXCURBUFLEN:9;
  uint32_t :7;
  uint32_t TXBUFCNT:5;
  uint32_t :4;
  uint32_t TXSTATE:4;
} __SQI1BDTXDSTATbits_t;
extern volatile __SQI1BDTXDSTATbits_t SQI1BDTXDSTATbits __asm__ ("SQI1BDTXDSTAT") __attribute__((section("sfrs"), address(0xBF8E204C)));
#define SQI1BDRXDSTAT SQI1BDRXDSTAT
extern volatile uint32_t   SQI1BDRXDSTAT __attribute__((section("sfrs"), address(0xBF8E2050)));
typedef struct {
  uint32_t RXCURBUFLEN:9;
  uint32_t :7;
  uint32_t RXBUFCNT:5;
  uint32_t :4;
  uint32_t RXSTATE:4;
} __SQI1BDRXDSTATbits_t;
extern volatile __SQI1BDRXDSTATbits_t SQI1BDRXDSTATbits __asm__ ("SQI1BDRXDSTAT") __attribute__((section("sfrs"), address(0xBF8E2050)));
#define SQI1THR SQI1THR
extern volatile uint32_t   SQI1THR __attribute__((section("sfrs"), address(0xBF8E2054)));
typedef struct {
  uint32_t THRES:4;
} __SQI1THRbits_t;
extern volatile __SQI1THRbits_t SQI1THRbits __asm__ ("SQI1THR") __attribute__((section("sfrs"), address(0xBF8E2054)));
#define SQI1INTSIGEN SQI1INTSIGEN
extern volatile uint32_t   SQI1INTSIGEN __attribute__((section("sfrs"), address(0xBF8E2058)));
typedef struct {
  uint32_t TXEMPTYISE:1;
  uint32_t TXFULLISE:1;
  uint32_t TXTHRISE:1;
  uint32_t RXEMPTYISE:1;
  uint32_t RXFULLISE:1;
  uint32_t RXTHRISE:1;
  uint32_t CONFULLISE:1;
  uint32_t CONEMPTYISE:1;
  uint32_t CONTHRISE:1;
  uint32_t BDDONEISE:1;
  uint32_t PKTCOMPISE:1;
  uint32_t DMAEISE:1;
} __SQI1INTSIGENbits_t;
