MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFH100/mcu.h
extern volatile __SBT9RD0bits_t SBT9RD0bits __asm__ ("SBT9RD0") __attribute__((section("sfrs"), address(0xBF8FA450)));
#define SBT9WR0 SBT9WR0
extern volatile uint32_t   SBT9WR0 __attribute__((section("sfrs"), address(0xBF8FA458)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT9WR0bits_t;
extern volatile __SBT9WR0bits_t SBT9WR0bits __asm__ ("SBT9WR0") __attribute__((section("sfrs"), address(0xBF8FA458)));
#define SBT9REG1 SBT9REG1
extern volatile uint32_t   SBT9REG1 __attribute__((section("sfrs"), address(0xBF8FA460)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT9REG1bits_t;
extern volatile __SBT9REG1bits_t SBT9REG1bits __asm__ ("SBT9REG1") __attribute__((section("sfrs"), address(0xBF8FA460)));
#define SBT9RD1 SBT9RD1
extern volatile uint32_t   SBT9RD1 __attribute__((section("sfrs"), address(0xBF8FA470)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT9RD1bits_t;
extern volatile __SBT9RD1bits_t SBT9RD1bits __asm__ ("SBT9RD1") __attribute__((section("sfrs"), address(0xBF8FA470)));
#define SBT9WR1 SBT9WR1
extern volatile uint32_t   SBT9WR1 __attribute__((section("sfrs"), address(0xBF8FA478)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT9WR1bits_t;
extern volatile __SBT9WR1bits_t SBT9WR1bits __asm__ ("SBT9WR1") __attribute__((section("sfrs"), address(0xBF8FA478)));
#define SBT10ELOG1 SBT10ELOG1
extern volatile uint32_t   SBT10ELOG1 __attribute__((section("sfrs"), address(0xBF8FA820)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT10ELOG1bits_t;
extern volatile __SBT10ELOG1bits_t SBT10ELOG1bits __asm__ ("SBT10ELOG1") __attribute__((section("sfrs"), address(0xBF8FA820)));
#define SBT10ELOG2 SBT10ELOG2
extern volatile uint32_t   SBT10ELOG2 __attribute__((section("sfrs"), address(0xBF8FA824)));
typedef struct {
  uint32_t GROUP:2;
} __SBT10ELOG2bits_t;
extern volatile __SBT10ELOG2bits_t SBT10ELOG2bits __asm__ ("SBT10ELOG2") __attribute__((section("sfrs"), address(0xBF8FA824)));
#define SBT10ECON SBT10ECON
extern volatile uint32_t   SBT10ECON __attribute__((section("sfrs"), address(0xBF8FA828)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT10ECONbits_t;
extern volatile __SBT10ECONbits_t SBT10ECONbits __asm__ ("SBT10ECON") __attribute__((section("sfrs"), address(0xBF8FA828)));
#define SBT10ECLRS SBT10ECLRS
extern volatile uint32_t   SBT10ECLRS __attribute__((section("sfrs"), address(0xBF8FA830)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT10ECLRSbits_t;
extern volatile __SBT10ECLRSbits_t SBT10ECLRSbits __asm__ ("SBT10ECLRS") __attribute__((section("sfrs"), address(0xBF8FA830)));
#define SBT10ECLRM SBT10ECLRM
extern volatile uint32_t   SBT10ECLRM __attribute__((section("sfrs"), address(0xBF8FA838)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT10ECLRMbits_t;
extern volatile __SBT10ECLRMbits_t SBT10ECLRMbits __asm__ ("SBT10ECLRM") __attribute__((section("sfrs"), address(0xBF8FA838)));
#define SBT10REG0 SBT10REG0
extern volatile uint32_t   SBT10REG0 __attribute__((section("sfrs"), address(0xBF8FA840)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT10REG0bits_t;
extern volatile __SBT10REG0bits_t SBT10REG0bits __asm__ ("SBT10REG0") __attribute__((section("sfrs"), address(0xBF8FA840)));
#define SBT10RD0 SBT10RD0
extern volatile uint32_t   SBT10RD0 __attribute__((section("sfrs"), address(0xBF8FA850)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT10RD0bits_t;
extern volatile __SBT10RD0bits_t SBT10RD0bits __asm__ ("SBT10RD0") __attribute__((section("sfrs"), address(0xBF8FA850)));
#define SBT10WR0 SBT10WR0
extern volatile uint32_t   SBT10WR0 __attribute__((section("sfrs"), address(0xBF8FA858)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT10WR0bits_t;
extern volatile __SBT10WR0bits_t SBT10WR0bits __asm__ ("SBT10WR0") __attribute__((section("sfrs"), address(0xBF8FA858)));
#define SBT11ELOG1 SBT11ELOG1
extern volatile uint32_t   SBT11ELOG1 __attribute__((section("sfrs"), address(0xBF8FAC20)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT11ELOG1bits_t;
extern volatile __SBT11ELOG1bits_t SBT11ELOG1bits __asm__ ("SBT11ELOG1") __attribute__((section("sfrs"), address(0xBF8FAC20)));
#define SBT11ELOG2 SBT11ELOG2
extern volatile uint32_t   SBT11ELOG2 __attribute__((section("sfrs"), address(0xBF8FAC24)));
typedef struct {
  uint32_t GROUP:2;
} __SBT11ELOG2bits_t;
extern volatile __SBT11ELOG2bits_t SBT11ELOG2bits __asm__ ("SBT11ELOG2") __attribute__((section("sfrs"), address(0xBF8FAC24)));
#define SBT11ECON SBT11ECON
extern volatile uint32_t   SBT11ECON __attribute__((section("sfrs"), address(0xBF8FAC28)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT11ECONbits_t;
extern volatile __SBT11ECONbits_t SBT11ECONbits __asm__ ("SBT11ECON") __attribute__((section("sfrs"), address(0xBF8FAC28)));
#define SBT11ECLRS SBT11ECLRS
extern volatile uint32_t   SBT11ECLRS __attribute__((section("sfrs"), address(0xBF8FAC30)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT11ECLRSbits_t;
extern volatile __SBT11ECLRSbits_t SBT11ECLRSbits __asm__ ("SBT11ECLRS") __attribute__((section("sfrs"), address(0xBF8FAC30)));
#define SBT11ECLRM SBT11ECLRM
extern volatile uint32_t   SBT11ECLRM __attribute__((section("sfrs"), address(0xBF8FAC38)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT11ECLRMbits_t;
extern volatile __SBT11ECLRMbits_t SBT11ECLRMbits __asm__ ("SBT11ECLRM") __attribute__((section("sfrs"), address(0xBF8FAC38)));
#define SBT11REG0 SBT11REG0
extern volatile uint32_t   SBT11REG0 __attribute__((section("sfrs"), address(0xBF8FAC40)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT11REG0bits_t;
extern volatile __SBT11REG0bits_t SBT11REG0bits __asm__ ("SBT11REG0") __attribute__((section("sfrs"), address(0xBF8FAC40)));
#define SBT11RD0 SBT11RD0
extern volatile uint32_t   SBT11RD0 __attribute__((section("sfrs"), address(0xBF8FAC50)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT11RD0bits_t;
